app/views/tasks/index.html.erb

SELECT "task_logs".* FROM "task_logs" WHERE "task_logs"."task_id" IN (110, 111, 102)
---
                </div>
                <div class="task-title <%= "executed" if task.task_logs.exists?(executed_on: Date.current) %>">

SELECT "task_logs".* FROM "task_logs" WHERE "task_logs"."task_id" IN (109, 106, 119, 117, 120, 118)
---
              <% week.each do |date| %>
                <% tasks_on_date = @tasks.select { |task| task.task_logs.exists?(executed_on: date) } %>