module TaskContents
    FREQUENCY_UNITS_LIST = [ "時間", "日", "週", "ヶ月" ]

    CATEGORIES_GROUPS = {
    "運動" => [ "ランニング", "ウォーキング", "筋トレ", "ストレッチ", "ヨガ", "これ以外のスポーツ" ],
    "金融" => [ "貯金", "投資" ],
    "学習" => [ "プログラミング", "語学", "英会話" ],
    "キャリア" => [ "タスク管理", "スキルアップ", "副業" ],
    "健康" => [ "メンタルケア", "睡眠", "バランスのいい食事", "自炊", "糖質制限", "ダイエット" ],
    "趣味" => [ "音楽", "執筆", "写真", "アウトドア" ],
    "社会活動" => [ "ボランティア", "イベント参加", "交流" ],
    "ライフログ" => [ "読書", "日記" ],
    "生活" => [ "部屋の片付け", "断捨離", "デジタルデトックス" ],
    "その他" => [ "これ以外" ]
    }

    COLORS = %w[orange blue green yellow yellowgreen red]

    COLOR_CODES = {
    "orange" => "#ff9318",
    "blue" => "#5fa9cb",
    "green" => "#1f785b",
    "yellow" => "#fab700",
    "yellowgreen" => "#b1df43",
    "red" => "#ff272e"
    }
end
