app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" ORDER BY "comments"."created_at" DESC
---
  def index
    @comments = Comment.includes(:user).order(created_at: :desc)

INSERT INTO "comments" ("user_id", "content", "created_at", "updated_at", "parent_id") VALUES (3, 'めぐめぐめぐ', '2025-05-26 11:40:24.398396', '2025-05-26 11:40:24.398396', NULL) RETURNING "id"
---
  def create
    @comment = current_user.comments.build(comment_params)
    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = 3 AND "comments"."id" = 14 LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 14
---
  def destroy
    @comment = current_user.comments.find(params[:id])
    @comment.destroy