app/controllers/tasks_controller.rb

  def index
    keyword = params[:q].presence&.strip

    @in_progress_tasks = Task.in_progress_for(current_user, keyword)
    @completed_tasks   = Task.completed_for(current_user, keyword)

    @tasks = current_user.tasks.includes(:task_logs)
    @tasks_on_date = tasks_grouped_by_date(@tasks)
    @random_message = current_user.tasks.pluck(:message).sample
---
SELECT "task_logs".* FROM "task_logs" WHERE "task_logs"."task_id" IN (109, 110, 111, 103, 104, 105, 102, 106, 107, 115, 108, 116)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 3 AND "tasks"."completed" = FALSE
SELECT "tasks"."message" FROM "tasks" WHERE "tasks"."user_id" = 3

    task = Task.find(params[:id])
    TaskLog.toggle_for(task, Date.current)

    executed = task.task_logs.exists?(executed_on: Date.current)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 110 LIMIT 1
UPDATE "tasks" SET "completed" = FALSE WHERE "tasks"."id" = 110
SELECT "task_logs".* FROM "task_logs" WHERE "task_logs"."task_id" = 110 AND "task_logs"."executed_on" = '2025-05-25' LIMIT 1
SELECT 1 AS one FROM "task_logs" WHERE "task_logs"."task_id" = 110 AND "task_logs"."executed_on" = '2025-05-25' LIMIT 1

  def edit_modal
    @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 109 LIMIT 1

  def create
    @task = current_user.tasks.build(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "description", "category", "frequency", "message", "start_date", "end_date", "color", "created_at", "updated_at", "frequency_number", "frequency_unit", "frequency_in_days", "user_id", "completed") VALUES ('ttt', '', 'Running', NULL, '', '2025-06-01', '2025-06-01', 'orange', '2025-06-01 07:04:50.174904', '2025-06-01 07:04:50.174904', 1, '日', NULL, 3, FALSE) RETURNING "id"

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "title" = '本を10ページ読む', "start_date" = '2025-05-25', "end_date" = '2025-05-25', "color" = 'orange', "updated_at" = '2025-05-25 11:35:42.057373' WHERE "tasks"."id" = 106

  def tasks_grouped_by_date(tasks)
    tasks.each_with_object(Hash.new([])) do |task, hash|
      task.task_logs.each do |log|
---
SELECT "task_logs".* FROM "task_logs" WHERE "task_logs"."task_id" IN (109, 110, 111, 103, 104, 105, 102, 106, 107, 115, 108, 116)