app/controllers/users_controller.rb

UPDATE "users" SET "updated_at" = '2025-05-25 11:34:30.641631', "show_completed_tasks" = FALSE WHERE "users"."id" = 3
---
  def toggle_completed_tasks
    return head :bad_request if params[:show_completed_tasks].nil?

    # JSONリクエストでは真偽値で送られるが、Railsは文字列として扱うため、Boolean型にキャストする
    value = ActiveModel::Type::Boolean.new.cast(params[:show_completed_tasks])

    if current_user.update(show_completed_tasks: value)

UPDATE "users" SET "updated_at" = '2025-06-01 08:25:09.453874', "name" = 'めぐぐ' WHERE "users"."id" = 3
---
  def update
    @user = current_user

    if @user.update(user_params)