app/models/task.rb

  def self.in_progress_for(user, keyword = nil)
    tasks = user.tasks.includes(:task_logs).where(completed: false)
    keyword.present? ? tasks.where("title LIKE ?", "%#{keyword}%") : tasks
---
SELECT "task_logs".* FROM "task_logs" WHERE "task_logs"."task_id" IN (110, 111, 106, 102, 109)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 3

  def self.completed_for(user, keyword = nil)
    tasks = user.tasks.includes(:task_logs).where(completed: true)
    keyword.present? ? tasks.where("title LIKE ?", "%#{keyword}%") : tasks
---
SELECT "task_logs".* FROM "task_logs" WHERE "task_logs"."task_id" IN (109, 110, 111, 103, 104, 105, 102, 106, 107, 115, 108, 116)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 3