app/models/task_log.rb

SELECT COUNT(DISTINCT "task_logs"."executed_on") FROM "task_logs" WHERE "task_logs"."task_id" = 109 AND "task_logs"."executed_on" BETWEEN '2025-05-13' AND '2025-06-10'
---
  def self.done_days(task)
    where(task_id: task.id, executed_on: task.start_date..task.end_date)
      .distinct
      .count(:executed_on)

SELECT "task_logs".* FROM "task_logs" WHERE "task_logs"."task_id" = 110 AND "task_logs"."executed_on" = '2025-05-25' LIMIT 1
DELETE FROM "task_logs" WHERE "task_logs"."id" = 715
---
  def self.toggle_for(task, date)
    log = task.task_logs.find_by(executed_on: date)
    if log
      log.destroy

SELECT COUNT(*) AS "count_all", "task_logs"."executed_on" AS "task_logs_executed_on" FROM "task_logs" INNER JOIN "tasks" ON "tasks"."id" = "task_logs"."task_id" WHERE "tasks"."user_id" = 3 GROUP BY "task_logs"."executed_on"
---
  def self.calculate_daily_progress(user)
    joins(:task)
      .where(tasks: { user_id: user.id })
      .group(:executed_on)
      .count

SELECT COUNT(*) AS "count_all", "task_logs"."executed_on" AS "task_logs_executed_on" FROM "task_logs" WHERE "task_logs"."user_id" = 3 AND "task_logs"."executed_on" BETWEEN '2025-05-12' AND '2025-05-25' GROUP BY "task_logs"."executed_on"
SELECT COUNT(*) AS "count_all", "task_logs"."executed_on" AS "task_logs_executed_on" FROM "task_logs" WHERE "task_logs"."user_id" = 3 AND "task_logs"."executed_on" BETWEEN '2025-05-19' AND '2025-06-01' GROUP BY "task_logs"."executed_on"
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = 3 AND (start_date <= '2025-05-12' AND end_date >= '2025-05-12')
---
  def self.calculate_chart_data(user)
    start_date = 13.days.ago.to_date
    end_date = Date.today
    date_range = (start_date..end_date).to_a

    progress_data = TaskLog.where(user_id: user.id, executed_on: start_date..end_date)
                           .group(:executed_on)
                           .count

    tasks = Task.where(user: user)
    assigned_tasks_by_date = date_range.each_with_object({}) do |date, hash|
      hash[date] = tasks.where("start_date <= ? AND end_date >= ?", date, date).count